Revit 2016 API
ScheduleDefinition Methods
The ScheduleDefinition type exposes the following members.
Methods
Name | Description
AddEmbeddedSchedule
 Adds an embedded ScheduleDefinition.
AddField(SchedulableField)
 Adds a regular field at the end of the list.
AddField(ScheduleFieldType)
 Adds a regular field at the end of the list.
AddField(ScheduleFieldType, ElementId)
 Adds a regular field at the end of the list.
AddFilter
 Adds a new filter at the end of the list.
AddSortGroupField
 Adds a new sorting/grouping field at the end of the list.
CanFilter
 Checks whether filters can be added to this ScheduleDefinition.
CanFilterByParameterExistence
 Checks whether a field can be used with a HasParameter filter.
CanFilterBySubstring
 Checks whether a field can be used with a substring-based filter.
CanFilterByValue
 Checks whether a field can be used with a value-based filter.
CanHaveEmbeddedSchedule
 Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition added.
CanIncludeLinkedFiles
 Checks whether the schedule is a type that supports including elements from linked files.
CanSortByField
 Checks whether a field can be used for sorting/grouping.
ClearFields
 Removes all fields.
ClearFilters
 Removes all filters.
ClearSortGroupFields
 Removes all sorting/grouping fields.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetField(Int32)
 Gets a field.
GetField(ScheduleFieldId)
 Gets a field.
GetFieldCount
 Gets the number of fields in this ScheduleDefinition.
GetFieldId
 Converts a field index to the corresponding field ID.
GetFieldIndex
 Converts a field ID to the corresponding field index.
GetFieldOrder
 Gets the IDs of the current list of fields in order.
GetFilter
 Gets a filter.
GetFilterCount
 Gets the number of filters in this ScheduleDefinition.
GetFilters
 Gets all filters in this ScheduleDefinition.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSchedulableFields
 Gets a list of all non-calculated/non-combined fields that are eligible to be included in this schedule.
GetSortGroupField
 Gets a sorting/grouping field.
GetSortGroupFieldCount
 Gets the number of sorting/grouping fields in this ScheduleDefinition.
GetSortGroupFields
 Gets all sorting/grouping fields in this ScheduleDefinition.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetValidCategoriesForEmbeddedSchedule
 Get all categories that can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
InsertField(SchedulableField, Int32)
 Adds a regular field at the specified position in the list.
InsertField(ScheduleFieldType, Int32)
 Adds a regular field at the specified position in the list.
InsertField(ScheduleFieldType, ElementId, Int32)
 Adds a regular field at the specified position in the list.
InsertFilter
 Adds a new filter at the specified position in the list.
InsertSortGroupField
 Adds a new sorting/grouping field at the specified position in the list.
IsSchedulableField
 Checks whether a non-calculated/non-combined field is eligible to be included in this schedule.
IsValidCategoryForEmbeddedSchedule
 Indicates if a category can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
IsValidFieldId
 Checks whether a ScheduleFieldId is the ID of a field in this ScheduleDefinition.
IsValidFieldIndex
 Checks whether an integer is a valid zero-based field index in this ScheduleDefinition.
RemoveEmbeddedSchedule
 Removes the embedded ScheduleDefinition.
RemoveField(Int32)
 Removes a field.
RemoveField(ScheduleFieldId)
 Removes a field.
RemoveFilter
 Removes a filter.
RemoveSortGroupField
 Removes a sorting/grouping field.
SetFieldOrder
 Reorders the fields in the schedule.
SetFilter
 Replaces a filter.
SetFilters
 Replaces all filters in this ScheduleDefinition.
SetSortGroupField
 Replaces a sorting/grouping field.
SetSortGroupFields
 Replaces all sorting/grouping fields in this ScheduleDefinition.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace